# MADE BY - ALPHA BABY

class Helper(object):
    HELP_M = '''```
❖ ᴄʜσσsє ᴛʜє ᴄᴧᴛєɢσʀʏ ғσʀ ᴡʜɪᴄʜ ʏσυ ᴡᴧηηᴧ ɢєᴛ ʜєʟᴩ```
**❖ ᴧsᴋ ʏσυʀ ᴅσυʙᴛs ᴧᴛ sυᴘᴘσʀᴛ ᴄʜᴧᴛ ᴧʟʟ ᴄσϻϻᴧηᴅs ᴄᴧη ʙє υsєᴅ ᴡɪᴛʜ : /**

**❖ ɴᴏᴛᴇ :- ɪꜰ ᴀɴʏ ᴄᴏᴍᴍᴀɴᴅ ᴅᴏᴇs ɴᴏᴛ ᴡᴏʀᴋ, ᴛʏᴘᴇ** `/bug reason` **ɪɴ ʀᴇᴘʟʏ ᴛᴏ ᴛʜᴇ ᴍᴇꜱꜱᴀɢᴇ.**
'''

    HELP_B = '''```
❖ ᴄʜσσsє ᴛʜє ᴄᴧᴛєɢσʀʏ ғσʀ ᴡʜɪᴄʜ ʏσυ ᴡᴧηηᴧ ɢєᴛ ʜєʟᴩ```
**❖ ᴧsᴋ ʏσυʀ ᴅσυʙᴛs ᴧᴛ sυᴘᴘσʀᴛ ᴄʜᴧᴛ ᴧʟʟ ᴄσϻϻᴧηᴅs ᴄᴧη ʙє υsєᴅ ᴡɪᴛʜ : /**

**❖ ɴᴏᴛᴇ :- ɪꜰ ᴀɴʏ ᴄᴏᴍᴍᴀɴᴅ ᴅᴏᴇs ɴᴏᴛ ᴡᴏʀᴋ, ᴛʏᴘᴇ** `/bug reason` **ɪɴ ʀᴇᴘʟʏ ᴛᴏ ᴛʜᴇ ᴍᴇꜱꜱᴀɢᴇ.**
'''


    HELP_Sona = '''```
❖ ʜєʟᴘ ϻᴧɪη ϻєηυ```
**❖ ᴄʜσσsє ᴛʜє ᴄᴧᴛєɢσʀʏ ғσʀ ᴡʜɪᴄʜ ʏσυ ᴡᴧηηᴧ ɢєᴛ ʜєʟᴩ**

**❖ ɴᴏᴛᴇ :- ɪꜰ ᴀɴʏ ᴄᴏᴍᴍᴀɴᴅ ᴅᴏᴇs ɴᴏᴛ ᴡᴏʀᴋ, ᴛʏᴘᴇ** `/bug reason` **ɪɴ ʀᴇᴘʟʏ ᴛᴏ ᴛʜᴇ ᴍᴇꜱꜱᴀɢᴇ.**
'''

#------------------------------------------------------------------------------------------------------------------------
# TOOL | TOOL | TOOL | TOOL | TOOL | TOOL | TOOL | TOOL | TOOL | TOOL | TOOL | TOOL | TOOL | TOOL | TOOL | TOOL | TOOL |
#------------------------------------------------------------------------------------------------------------------------

    HELP_01 = '''```
❖ ᴄʜᴧᴛɢᴘᴛ ᴄσϻϻᴧηᴅꜱ ❖```
**<u>❖ ᴧᴠᴧɪʟᴧʙʟє ᴄσϻϻᴧηᴅs ꜰσʀ ᴄʜᴧᴛɢᴘᴛ :</u>**

**❖ ᴧɪ|ᴄʜᴧᴛɢᴘᴛ ᴄσϻϻᴧηᴅs :

❍ /ask [ǫυєʀʏ] : sєᴧʀᴄʜ ᴛʜє ᴧηʏ ᴛʏᴘє ǫυєsᴛɪση.

❖ ɪηѕᴛᴧɢʀᴧϻ ʀєєʟ ᴅᴏᴡηʟᴏᴧᴅєʀ :

❍ /ig [URL]: ᴅᴏᴡηʟᴏᴧᴅ ɪηѕᴛᴧɢʀᴧϻ ʀєєʟѕ.
❍ /reel [URL]: ᴅᴏᴡηʟᴏᴧᴅ ɪηѕᴛᴧɢʀᴧϻ ʀєєʟѕ.

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐀 ꯭ʟ ꯭ᴘ ꯭ʜ꯭ ᴧ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/TheSigmaCoder)**
'''


    HELP_02 = '''```
❖ sєᴧʀᴄʜ ᴄσϻϻᴧηᴅꜱ ❖```
**<u>❖ ᴧᴠᴧɪʟᴧʙʟє ᴄσϻϻᴧηᴅs ꜰσʀ sєᴧʀᴄʜ :</u>**

**❍ /google [ǫυєʀʏ] : sєᴧʀᴄʜ ᴛʜє ɢσσɢʟє ғσʀ ᴛʜє ɢɪᴠєη ǫυєʀʏ
❍ /waifu [ǫυєʀʏ] : sєᴧʀᴄʜ ʀᴀɴᴅᴏᴍ ᴡᴧɪғᴜ ғσʀ ᴛʜє ɢɪᴠєη ǫυєʀʏ
❍ /bored [ǫυєʀʏ] : ᴛɪϻєᴅ σᴜᴛ ʙᴏʀɪηɢ ϻσσᴅs ғσʀ ᴛʜє ɢɪᴠєη ǫυєʀʏ
❍ /image [ǫυєʀʏ] : ɢєᴛ ᴛʜє ɪϻᴧɢєs ʀєɢᴧʀᴅɪηɢ ᴛσ ʏσυʀ ǫυєʀʏ
❍ /math [ǫυєʀʏ] : ɢєᴛ sσʟᴠєᴅ ϻᴧᴛʜ ǫᴜєsᴛɪσηs.** `єx - 2 + 2`
❍ /qrcode : ɢᴇɴ ǫʀ ᴄᴏᴅᴇ.

```
❖ єxᴧϻᴘʟє : /google ʜɪɴᴅɪ sᴏɴɢs```

**❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐀 ꯭ʟ ꯭ᴘ ꯭ʜ꯭ ᴧ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/TheSigmaCoder)**
'''

    HELP_03 = '''```
❖ ᴡʜɪsᴘᴇʀ ❖```
**<u>❖ sᴇɴᴅ ᴡʜɪsᴘᴇʀ ᴍᴇssᴀɢᴇ ❖</u>**

**ᴜsᴀɢᴇ :- ʙᴏᴛ ᴜsᴇʀɴᴀᴍᴇ | ɪᴅ/ᴜsᴇʀɴᴀᴍᴇ | ᴛᴇxᴛ**

```
єxᴧϻᴘʟє : @Sonali_Music_bot @TheSigmaCoder I love You 😘
```

**❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐀 ꯭ʟ ꯭ᴘ ꯭ʜ꯭ ᴧ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/TheSigmaCoder)**
'''


    HELP_04 = '''```
❖ ɪηꜰσ ᴄσϻϻᴧηᴅꜱ ❖```
**<u>❖ ᴧᴠᴧɪʟᴧʙʟє ᴄσϻϻᴧηᴅs ꜰσʀ ɪηꜰσ :</u>**

**❍ /id : ɢєᴛ ᴛʜє ᴄυʀʀєηᴛ ɢʀσυᴘ ɪᴅ. ɪғ υsєᴅ ʙʏ ʀєᴘʟʏɪηɢ ᴛσ ᴧ ϻєssᴧɢє, ɢєᴛs ᴛʜᴧᴛ υsєʀ's ɪᴅ
❍ /info : ɢєᴛ ɪηғσʀϻᴧᴛɪση ᴧʙσυᴛ ᴧ υsєʀ.
❍ /givelink : ɢєᴛ ᴄᴜʀʀєηᴛ ɢʀσᴜᴘ ʟɪηᴋ
❍ /groupdata : ɢєᴛ ʏᴏᴜʀ ɢʀᴏᴜᴘ ᴅᴧᴛᴧ
❍ /groupinfo : ɢєᴛ ʏσᴜʀ ɢʀσᴜᴘ ɪηғσ `ᴇx :- /groupinfo ɢʀᴏᴜᴘ ᴜsᴇʀɴᴀᴍᴇ`
❍ /status : ɢєᴛ ʏσᴜʀ ɢʀσᴜᴘ sᴛᴧᴛᴜs

**❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐀 ꯭ʟ ꯭ᴘ ꯭ʜ꯭ ᴧ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/TheSigmaCoder)**
'''



    HELP_05 = '''```
❖ ғσηᴛ ❖```
**<u>❖ ᴧᴠᴧɪʟᴧʙʟє ᴄσϻϻᴧηᴅs ꜰσʀ ғσηᴛ :</u>**

**ʙʏ υsɪηɢ ᴛʜɪs ϻσᴅυʟє ʏσυ ᴄᴧη ᴄʜᴧηɢє ғσηᴛs σғ ᴧηʏ ᴛєxᴛ

❍ /font [ᴛєxᴛ]**
```
❖ єxᴧϻᴘʟє : /font Alpha Baby```

**❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐀 ꯭ʟ ꯭ᴘ ꯭ʜ꯭ ᴧ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/TheSigmaCoder)**
'''


    HELP_07 = '''```
❖ ᴛᴧɢ ᴄσϻϻᴧηᴅꜱ ❖```
**<u>❖ ᴧᴠᴧɪʟᴧʙʟє ᴄσϻϻᴧηᴅs ꜰσʀ ᴛᴧɢ :</u>**

**✿ ᴄʜσσsє ᴛᴧɢ ɪη ʏσυʀ ᴄʜᴧᴛ ✿

❍ /rtag ➠ ʀᴧηᴅσϻ ᴛᴧɢ ꜱᴛᴧʀᴛ
❍ /rstop ➠ ꜱᴛσᴘ ʀᴧηᴅσϻ ᴛᴧɢ

❍ /vctag ➠ ᴠɪᴅєᴏ ᴄʜᴧᴛ ᴛᴧɢ ꜱᴛᴧʀᴛ
❍ /vstop ➠ ꜱᴛσᴘ ᴠɪᴅєᴏ ᴄʜᴧᴛ ᴛᴧɢ

❍ /entag ➠ єηɢʟɪsʜ ᴛᴧɢ ꜱᴛᴧʀᴛ
❍ /enstop ➠ ꜱᴛσᴘ єηɢʟɪsʜ ᴛᴧɢ

❍ /bhtag ➠ ʙʜσᴊᴘᴜʀɪ ᴛᴧɢ ꜱᴛᴧʀᴛ
❍ /bhstop ➠ ꜱᴛσᴘ ʙʜσᴊᴘᴜʀɪ ᴛᴧɢ

❍ /hitag ➠ ʜɪηᴅɪ ᴛᴧɢ ꜱᴛᴧʀᴛ
❍ /histop ➠ ꜱᴛσᴘ ʜɪηᴅɪ ᴛᴧɢ

❍ /lifetag ➠ ʟɪғє ǫυσᴛєꜱ ᴛᴧɢ ꜱᴛᴧʀᴛ
❍ /lstop ➠ ꜱᴛσᴘ ʟɪғє ᴛᴧɢ

❍ /gntag ➠ ɢσσᴅ ηɪɢʜᴛ ᴛᴧɢ ꜱᴛᴧʀᴛ
❍ /gnstop ➠ ꜱᴛσᴘ ɢη ᴛᴧɢ

❍ /gmtag ➠ ɢσσᴅ ϻσʀηɪηɢ ᴛᴧɢ ꜱᴛᴧʀᴛ
❍ /gmstop ➠ ꜱᴛᴏᴘ ɢϻ ᴛᴧɢ

❍ /tagall ➠ ᴧηʏ ᴡʀɪᴛᴛєη ᴛєxᴛ ᴛᴧɢ (ᴜsєʀ + ᴀᴅᴍɪɴ)
❍ /atag ➠ ᴧηʏ ᴡʀɪᴛᴛєη ᴛєxᴛ ᴛᴧɢ σɴʟʏ ᴀᴅᴍɪɴ 
❍ /cancel ➠ ꜱᴛσᴘ ᴧʟʟ ᴛᴧɢ

❍ /stag ➠ ʀᴧηᴅσϻ ꜱʜᴧʏᴧʀɪ ᴛᴧɢ ꜱᴛᴧʀᴛ
❍ /sstop ➠ ꜱᴛσᴘ ꜱʜᴧʏᴧʀɪ ᴛᴧɢ

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐀 ꯭ʟ ꯭ᴘ ꯭ʜ꯭ ᴧ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/ll_ALPHA_BABY_lll)**
'''


    HELP_08 = '''```
❖ ᴄᴏᴜᴘʟᴇs ᴄσϻϻᴧηᴅꜱ ❖```
**<u>❖ ᴧᴠᴧɪʟᴧʙʟє ᴄσϻϻᴧηᴅs ꜰσʀ ᴄᴏᴜᴘʟᴇs :</u>**

**❍ /couples ➠ ᴜsє ᴛʜɪs ᴄσϻϻᴧηᴅ ᴧηᴅ sєє ɢʀσᴜᴘs ᴄσᴜᴘʟєs.
❍ /wish ➠ ᴜsє ᴛʜɪs ᴄσϻϻᴧηᴅ ᴧηᴅ sєє ɢʀσᴜᴘs ᴄσᴜᴘʟєs.
❍ /cute ➠ ᴄʜєᴄᴋ ʏσυʀ ᴄυᴛєηєss.
❍ /love ➠ ᴧᴅᴅ ᴛᴡᴏ ηᴧϻєs ᴧηᴅ sєє ʟσᴠᴇ ᴘσssɪʙɪʟɪᴛʏ !! `ʟɪᴋᴇ ʀᴧᴊᴧ + sσηᴧ.`

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐀 ꯭ʟ ꯭ᴘ ꯭ʜ꯭ ᴧ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/TheSigmaCoder)**
'''


    HELP_10 = '''```
❖ sᴛɪᴄᴋєʀs ᴄσϻϻᴧηᴅꜱ ❖```
**<u>❖ ᴧᴠᴧɪʟᴧʙʟє ᴄσϻϻᴧηᴅs ꜰσʀ sᴛɪᴄᴋєʀs :</u>**

**❍ /packkang ➠ ᴄʀєᴧᴛєs ᴧ ᴘᴧᴄᴋ σғ sᴛɪᴄᴋєʀs ғʀσϻ ᴧ σᴛʜєʀ ᴘᴧᴄᴋ
❍ /stickerid ➠ ɢєᴛs ᴛʜє sᴛɪᴄᴋєʀ ɪᴅ σғ ᴧ sᴛɪᴄᴋєʀ
❍ /mmf ➠ ʀєᴘʟʏ ᴧηʏ ᴘɪᴄ & ɢɪᴠє ᴛєxᴛ `єx :- /mmf alpha`
❍ /kang ➠ ʀєᴘʟʏ ᴧηʏ sᴛɪᴄᴋєʀ & ᴄʀєᴀᴛє ʏσᴜʀ sᴛɪᴄᴋєʀ ᴘᴧᴄᴋ
❍ /st ➠ ғɪηᴅ ᴏʀɪɢɪηᴧʟ sᴛɪᴄᴋєʀ.

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐀 ꯭ʟ ꯭ᴘ ꯭ʜ꯭ ᴧ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/TheSigmaCoder)**
'''


    HELP_11 = '''```
❖ ғυη ❖```
**<u>ʜєʀє ɪs ᴛʜє ʜєʟᴘ ғσʀ ғυη ϻσᴅυʟє :</u>**

❍ /cute [ᴄʜєᴄᴋ ʏσυʀ ᴄυᴛєηєss]
❍ /horny [ᴄʜєᴄᴋ ʏσυʀ ʜσʀηʏηєss]
❍ /lezbian [ᴄʜєᴄᴋ ʜσᴡ ϻυᴄʜ ʟєᴢʙɪᴧη ʏσυ ᴧʀє]
❍ /gay [ᴄʜєᴄᴋ ʜσᴡ ϻυᴄʜ ɢᴧʏ ʏσυ ᴧʀє]
❍ /rand [ᴄʜєᴄᴋ ʜσᴡ ϻυᴄʜ ʀᴧηᴅ ʏσυ ᴧʀє]
❍ /boob [ᴄʜєᴄᴋ ʏσυʀ ʙσσʙs sɪᴢє]
❍ /cock [ᴄʜєᴄᴋ ʏσυʀ ᴅɪᴄᴋ sɪᴢє]
❍ /truth [sєηᴅs ᴧ ʀᴧηᴅσϻ ᴛʀυᴛʜ sᴛʀɪηɢ]
❍ /dare : [sєηᴅs ᴧ ʀᴧηᴅσϻ ᴅᴧʀє sᴛʀɪηɢ]
❍ /gali : [sєηᴅs ᴧ ʀᴧηᴅσϻ ᴧʙᴜsє sᴛʀɪηɢ]

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐀 ꯭ʟ ꯭ᴘ ꯭ʜ꯭ ᴧ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/TheSigmaCoder)**
'''


    HELP_12 = '''```
❖ ǫυσᴛʟʏ ❖```
**<u>ʜєʀє ɪs ᴛʜє ʜєʟᴘ ғσʀ ᴛʜє ǫυσᴛʟʏ ϻσᴅυʟє :</u>**

**❍ /q : ᴄʀєᴧᴛє ᴧ ǫυσᴛє ғʀσϻ ᴛʜє ϻєssᴧɢє
❍ /q r : ᴄʀєᴧᴛє ᴧ ǫυσᴛє ғʀσϻ ᴛʜє ϻєssᴧɢє ᴡɪᴛʜ ʀєᴘʟʏ

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐀 ꯭ʟ ꯭ᴘ ꯭ʜ꯭ ᴧ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/TheSigmaCoder)**
'''



#------------------------------------------------------------------------------------------------------------------------
# MANAGEMENT | MANAGEMENT | MANAGEMENT | MANAGEMENT | MANAGEMENT | MANAGEMENT | MANAGEMENT | MANAGEMENT | MANAGEMENT | 
#------------------------------------------------------------------------------------------------------------------------





    HELP_14 = '''```
❖ ᴧᴄᴛɪση```
**<u>❖ ᴧᴠᴧɪʟᴧʙʟє ᴄσϻϻᴧηᴅs ꜰσʀ ᴧᴄᴛɪση :</u>**

<u>**❖ ʙᴧη ᴄσϻϻᴧηᴅꜱ ❖**</u>

**❍ /ban <userhandle> : ʙᴧηs ᴧ υsєʀ.
❍ /unban <userhandle> : υηʙᴧηs ᴧ υsєʀ**

<u>**❖ ᴋɪᴄᴋs ᴄσϻϻᴧηᴅꜱ ❖**</u>

**❍ /kick <userhandle> : ᴋɪᴄᴋs ᴧ υsєʀ συᴛ σғ ᴛʜє ɢʀσυᴘ**

<u>**❖ ᴡᴀʀɴ ᴄσϻϻᴧηᴅꜱ ❖**</u>

**❍ /warn <userhandle> : ɢɪᴠᴇ ᴡᴀʀɴɪɴɢ ᴀ ᴜsᴇʀ
❍ /rmwarn <userhandle> : ʀᴇᴍᴏᴠᴇ ᴡᴀʀɴɪɴɢ ᴀ ᴜsᴇʀ
❍ /warns <userhandle> : ᴄʜᴇᴄᴋ ᴜsᴇʀ ᴡᴀʀɴ ᴄᴏᴜɴᴛs**

<u>**❖ ᴘʀᴏᴍᴏᴛᴇ ᴄσϻϻᴧηᴅꜱ ❖**</u>

**❍ /promote <userhandle> : ᴘʀᴏᴍᴏᴛᴇ ᴀᴅᴍɪɴ ɪɴ ʏᴏɪʀ ɢʀᴏᴜᴘ
❍ /demote <userhandle> : ᴅᴇᴍᴏᴛᴇ ᴀᴅᴍɪɴ  ɪɴ ʏᴏᴜʀ ɢʀᴏᴜᴘ
❍ /fullpromote <userhandle> : ᴘʀᴏᴍᴏᴛᴇ ᴀᴅᴍɪɴ ғᴜʟʟ ʀɪɢʜᴛs**

<u>**❖ ϻυᴛє ᴄσϻϻᴧηᴅꜱ ❖**</u>

**❍ /mute <userhandle> : ᴍᴜᴛᴇ ᴧ υsєʀ ɪɴ ʏᴏᴜʀ ɢʀᴏᴜᴘ
❍ /tmute <userhandle> : ϻυᴛєs ᴧ υsєʀ ғσʀ sᴘᴇᴄɪғɪᴄ ᴛɪϻє.
❍ /unmute <userhandle>: υηϻυᴛєs ᴧ υsєʀ ɪɴ ʏᴏᴜʀ ɢʀᴏᴜᴘ**

```
ᴛʜɪs ᴄσϻϻᴧηᴅ ᴡɪʟʟ ᴡσʀᴋ σηʟʏ ɪғ ʏσυ ɢɪᴠє ʙᴧη ᴏʀ ɴᴇᴡ ᴀᴅᴍɪɴ ʀɪɢʜᴛs ᴛσ ᴛʜє ʙσᴛ ᴡɪᴛʜ ᴧᴅϻɪη```


**❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐀 ꯭ʟ ꯭ᴘ ꯭ʜ꯭ ᴧ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/TheSigmaCoder)**
'''


    HELP_17 = '''```
❖ ɢʀσυᴘ ϻᴧηᴧɢєϻєηᴛ```

**<u>❖ ᴧᴠᴧɪʟᴧʙʟє ᴄσϻϻᴧηᴅs ꜰσʀ ɢʀσυᴘ :</u>**

<u>**❖ ᴘɪη|υηᴘɪη ᴄσϻϻᴧηᴅꜱ ❖**</u>

**❍ /pin ➠ ᴘɪηs ᴧ ϻєssᴧɢє ɪη ɢʀσυᴘ
❍ /pinned ➠ ᴘɪηηєᴅ ϻєssᴧɢє ɪη ɢʀσυᴘ
❍ /unpin ➠ υηᴘɪηs ᴄυʀʀєηᴛʟʏ ᴘɪηηєᴅ ϻєssᴧɢє**


<u>**❖ sᴛᴧғғ|ʙσᴛs ᴄσϻϻᴧηᴅꜱ ❖**</u>

**❍ /staff ➠ ʟɪsᴛ σғ sᴛᴧғғ ϻєϻʙєʀs.
❍ /bots ➠ ʟɪsᴛ σғ ʙσᴛs ɪη ᴛʜє ɢʀσυᴘ.
❍ /privacy ➠ sʜσᴡ σᴜʀ ʙσᴛ ᴘʀɪᴠᴧᴄʏ.**

<u>**❖ ɢʀσυᴘ sєᴛ υᴘ ᴄσϻϻᴧηᴅꜱ ❖**</u>

**❍ /settitle ➠ sєᴛs ᴛɪᴛʟє σғ ɢʀσυᴘ
❍ /setdiscription ➠ sєᴛs ᴅєsᴄʀɪᴘᴛɪση σғ ɢʀσυᴘ
❍ /setphoto ➠ sєᴛs ᴛʜє ɢʀσυᴘ ᴘʜσᴛσ
❍ /removephoto ➠ ʀєϻσᴠєs ᴛʜє ɢʀσυᴘ ᴘʜσᴛσ
❍ /unmuteall ➠ ᴜηϻᴜᴛᴇ ᴧʟʟ ϻᴜᴛᴇ ϻєϻʙєʀs
❍ /unbanall ➠ ᴜηʙᴧη ᴧʟʟ ʙᴧη ϻєϻʙєʀs
❍ /unpinall ➠ ᴜηᴘɪη ᴧʟʟ ᴘɪη ᴍєssᴧɢᴇ**

**❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐀 ꯭ʟ ꯭ᴘ ꯭ʜ꯭ ᴧ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/TheSigmaCoder)**
'''


    HELP_21 = '''```
❖ ɢᴧϻє ᴘʟᴧʏ ❖```
**<u>❖ ʜєʀє ᴧʀє sσϻє ϻɪηɪ ɢᴧϻєs :</u>**

**❍ /dice [ʀσʟʟ ᴧ ᴅɪᴄє]
❍ /dart [ᴛʜʀσᴡ ᴧ ᴅᴧʀᴛ]
❍ /jackpot [ᴊᴧᴄᴋᴘσᴛ ϻᴧᴄʜɪηє]
❍ /ball [ʙσᴡʟɪηɢ ɢᴧϻє]
❍ /basket [ʙᴧsᴋєᴛʙᴧʟʟ ɢᴧϻє]
❍ /football [ғσσᴛʙᴧʟʟ ɢᴧϻє]

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐀 ꯭ʟ ꯭ᴘ ꯭ʜ꯭ ᴧ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/TheSigmaCoder)**
'''



    HELP_23 = '''```
❖ ʜɪsᴛσʀʏ ᴄσϻϻᴧηᴅ ❖```
**<u>❖ ʜєʀє ɪs ᴛʜє ʜєʟᴘ ғσʀ ʜɪsᴛᴏʀʏ :</u>**

**❍ /sg ➠ υsєʀ ηᴧϻє & υsєʀηᴧϻє ʜɪsᴛσʀʏ.**

**<u>❖ ɪϻᴘσsᴛєʀ ❖</u>**

**❍ /imposter enable 
❍ /imposter disable 

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐀 ꯭ʟ ꯭ᴘ ꯭ʜ꯭ ᴧ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/TheSigmaCoder)**
'''

    HELP_24 = '''```
❖ ᴛʀᴧηsʟᴧᴛєs ❖```
**<u>❖ ᴧᴠᴧɪʟᴧʙʟє ᴄσϻϻᴧηᴅs ꜰσʀ ᴛʀᴧηsʟᴧᴛєs :</u>**

**❍ /tr ➠ ᴄᴧη ᴛʀᴧηꜱʟᴧᴛє ϻυʟᴛɪᴘʟє ʟᴧηɢυᴧɢєs.

⋟ ᴄσᴜɴᴛʀʏ ʟᴀɴɢ ᴄσᴅє :- [ᴄʟɪᴄᴋ ʜєʀє](https://telegra.ph/%E1%B4%84%E1%B4%8F%E1%B4%9C%C9%B4%E1%B4%9B%CA%80%CA%8F-%CA%9F%C9%AAs%E1%B4%9B-%E1%B4%A1%C9%AA%E1%B4%9B%CA%9C-%CA%9F%E1%B4%80%C9%B4%C9%A2%E1%B4%9C%E1%B4%80%C9%A2%E1%B4%87-%E1%B4%84%E1%B4%8F%E1%B4%85%E1%B4%87-08-28)

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐀 ꯭ʟ ꯭ᴘ ꯭ʜ꯭ ᴧ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/TheSigmaCoder)**
'''


    HELP_25 = '''```
❖ ɢɪᴛʜᴜʙ ᴄσϻϻᴧηᴅꜱ ❖```
**<u>❖ ᴧᴠᴧɪʟᴧʙʟє ᴄσϻϻᴧηᴅs ꜰσʀ ɢɪᴛʜᴜʙ :</u>**

**❍ /git ➠ ғɪηᴅ ʀєᴘᴏ ɢɪᴛ ᴜsєʀηᴧϻє
❍ /allrepo ➠ sєє ᴧʟʟ ʀєᴘᴏ ᴛʜʀσᴜɢʜ ɢɪᴛ ᴜsєʀηᴧϻє
❍ /downloadrepo ➠ ᴅσᴡηʟσᴧᴅ ᴢɪᴘ ᴛʜʀσᴜɢʜ ʀєᴘᴏ ᴜʀʟ.**

`єxᴧϻᴘʟє : /git TEAMPURVI`

**❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐀 ꯭ʟ ꯭ᴘ ꯭ʜ꯭ ᴧ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/TheSigmaCoder)**
'''


    HELP_26 = '''```
❖ ᴛєʟєɢʀᴧᴘʜ ❖```
**<u>❖ ᴧᴠᴧɪʟᴧʙʟє ᴄσϻϻᴧηᴅs ꜰσʀ ᴛєʟєɢʀᴧᴘʜ :</u>**

**ᴄʀєᴧᴛє ᴧ ᴛєʟєɢʀᴧᴘʜ ʟɪηᴋ ᴧηʏ ϻєᴅɪᴧ!

❍ /tgm [ʀєᴘʟʏ ᴛσ ᴧηʏ ϻєᴅɪᴧ]
❍ /tgt [ʀєᴘʟʏ ᴛσ ᴧηʏ ϻєᴅɪᴧ]

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐀 ꯭ʟ ꯭ᴘ ꯭ʜ꯭ ᴧ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/TheSigmaCoder)**
'''

    
    HELP_27 = '''```
❖ ᴛᴛs ❖```
**<u>ʜєʀє ɪs ᴛʜє ʜєʟᴘ ғσʀ ᴛᴛs :</u>**

**❍ /tts : ᴛєxᴛ ᴛσ ᴠσɪᴄє
❍ /zombies : ᴄʟᴇᴀɴ ᴅᴇʟᴇᴛᴇ ᴀᴄᴄᴏᴜɴᴛs
❍ /mongochk : ᴄʜᴇᴀᴄᴋ ᴍᴏɴɢᴏ ᴄᴏɴɴᴇᴄᴛɪᴏɴ

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐀 ꯭ʟ ꯭ᴘ ꯭ʜ꯭ ᴧ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/TheSigmaCoder)**
'''


    HELP_28 = '''```
❖ ᴀɴᴛɪ ғʟᴏᴏᴅ ❖```
**<u>❖ ᴧᴠᴧɪʟᴧʙʟє ᴄσϻϻᴧηᴅs ꜰσʀ ᴀɴᴛɪ ғʟᴏᴏᴅ :</u>**

**❍ /flood : ɢᴇᴛ ᴛʜᴇ ᴄᴜʀʀᴇɴᴛ ᴀɴᴛɪғʟᴏᴏᴅ ꜱᴇᴛᴛɪɴɢꜱ

❍ /setflood <number/off/no>: ꜱᴇᴛ ᴛʜᴇ ɴᴜᴍʙᴇʀ ᴏғ ᴄᴏɴꜱᴇᴄᴜᴛɪᴠᴇ ᴍᴇꜱꜱᴀɢᴇꜱ ᴛᴏ ᴛʀɪɢɢᴇʀ ᴀɴᴛɪғʟᴏᴏᴅ. ꜱᴇᴛ ᴛᴏ '0', 'ᴏғғ', ᴏʀ 'ɴᴏ' ᴛᴏ ᴅɪꜱᴀʙʟᴇ.

❍ /setfloodtimer <count> <duration>: ꜱᴇᴛ ᴛʜᴇ ɴᴜᴍʙᴇʀ ᴏғ ᴍᴇꜱꜱᴀɢᴇꜱ ᴀɴᴅ ᴛɪᴍᴇ ʀᴇQᴜɪʀᴇᴅ ғᴏʀ ᴛɪᴍᴇᴅ ᴀɴᴛɪғʟᴏᴏᴅ ᴛᴏ ᴛᴀᴋᴇ ᴀᴄᴛɪᴏɴ ᴏɴ ᴀ ᴜꜱᴇʀ. ꜱᴇᴛ ᴛᴏ ᴊᴜꜱᴛ 'ᴏғғ' ᴏʀ 'ɴᴏ' ᴛᴏ ᴅɪꜱᴀʙʟᴇ.

❍ /floodmode <action type>: ᴄʜᴏᴏꜱᴇ ᴡʜɪᴄʜ ᴀᴄᴛɪᴏɴ ᴛᴏ ᴛᴀᴋᴇ ᴏɴ ᴀ ᴜꜱᴇʀ ᴡʜᴏ ʜᴀꜱ ʙᴇᴇɴ ғʟᴏᴏᴅɪɴɢ. ᴘᴏꜱꜱɪʙʟᴇ ᴀᴄᴛɪᴏɴꜱ: ban/mute/kick/tban/tmute

❍ /clearflood <yes/no/on/off>: ᴡʜᴇᴛʜᴇʀ ᴛᴏ ᴅᴇʟᴇᴛᴇ ᴛʜᴇ ᴍᴇꜱꜱᴀɢᴇꜱ ᴛʜᴀᴛ ᴛʀɪɢɢᴇʀᴇᴅ ᴛʜᴇ ғʟᴏᴏᴅ.


❖ ᴇxᴀᴍᴘʟᴇꜱ :-

ꜱᴇᴛ ᴀɴᴛɪғʟᴏᴏᴅ ᴛᴏ ᴛʀɪɢɢᴇʀ ᴀғᴛᴇʀ 7 ᴍᴇꜱꜱᴀɢᴇꜱ :
-> /setflood 7

ᴅɪꜱᴀʙʟᴇ ᴀɴᴛɪғʟᴏᴏᴅ :
-> /setflood off

ꜱᴇᴛ ᴛɪᴍᴇᴅ ᴀɴᴛɪғʟᴏᴏᴅ ᴛᴏ ᴛʀɪɢɢᴇʀ ᴀғᴛᴇʀ 10 ᴍᴇꜱꜱᴀɢᴇꜱ ɪɴ 30 ꜱᴇᴄᴏɴᴅꜱ :
-> /setfloodtimer 10 30s

ᴅɪꜱᴀʙʟᴇᴅ ᴛɪᴍᴇᴅ ᴀɴᴛɪғʟᴏᴏᴅ :
-> /setfloodtimer off

ꜱᴇᴛ ᴛʜᴇ ᴀɴᴛɪғʟᴏᴏᴅ ᴀᴄᴛɪᴏɴ ᴛᴏ ᴍᴜᴛᴇ :
-> /floodmode mute

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐀 ꯭ʟ ꯭ᴘ ꯭ʜ꯭ ᴧ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/TheSigmaCoder)**
'''

    HELP_29 = '''```
❖ ᴀᴘᴘʀᴏᴠᴀʟ ᴍᴏᴅᴇ ❖```
**<u>❖ ᴧᴘᴘʀᴏᴠᴀʟ ᴍᴏᴅᴇ ᴛʜʀᴏᴜɢʜ ʙᴜᴛᴛᴏɴ :</u>**

**❍ ᴡʜᴇɴ ᴜsᴇʀ sᴇɴᴅ ᴊᴏɪɴ ʀᴇǫᴜᴇsᴛ ʙᴏᴛ sᴇɴᴅ ᴜsᴇʀ ɪɴғᴏ ᴡɪᴛʜ ɪɴʟɪɴᴇ ʙᴜᴛᴛᴏɴ ɪɴ ɢʀᴏᴜᴘ** 

```
⋟ ᴏɴʟʏ ᴀᴅᴍɪɴ ᴄᴀɴ ᴀᴘᴘʀᴏᴠᴇ ᴀɴᴅ ᴅɪsᴍɪss ᴀɴᴅ ᴍᴇss ᴀᴜᴛᴏ ᴅᴇʟᴇᴛᴇ ɪɴ 10 ᴍɪɴᴜᴛᴇs.```

**❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐀 ꯭ʟ ꯭ᴘ ꯭ʜ꯭ ᴧ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/TheSigmaCoder)**
'''
    
    HELP_30 = '''```
❖ ʙᴜɢ ʀᴇᴘᴏʀᴛ ❖```
**<u>❖ ᴧᴠᴧɪʟᴧʙʟє ᴄσϻϻᴧηᴅs ꜰσʀ ʙᴜɢ :</u>**

**❍ /bug [ʀᴇᴀsᴏɴ] :- ʀᴇᴘʟʏ ᴛᴏ ᴀ ᴍᴇssᴀɢᴇ & ɢɪᴠᴇ ᴀ ʀᴇᴀsᴏɴ ғᴏʀ ʙᴜɢ ʀᴇᴘᴏʀᴛ**

```
❖ ᴘʟᴇᴀsᴇ ᴍᴜsᴛ ʀᴇᴘʟʏ ᴏɴ ɴᴏᴛ ᴡᴏʀᴋɪɴɢ ᴄᴏᴍᴍᴀɴᴅs.```

**<u>❖ sᴏᴜʀᴄᴇ/ʀᴇᴘᴏ ❖</u>**

**❍ /repo :- ɢᴇᴛ ᴛᴇᴀᴍ ᴘᴜʀᴠɪ ʀᴇᴘᴏs

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐀 ꯭ʟ ꯭ᴘ ꯭ʜ꯭ ᴧ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/TheSigmaCoder)**
'''

    
    HELP_31 = '''```
❖ ᴄᴏᴜɴᴛʀʏ ɪɴғᴏ ❖```
**<u>❖ ʜєʀє ɪs ᴛʜє ʜєʟᴘ ғσʀ ᴄᴏᴜɴᴛʀʏ ɪɴғᴏ :</u>**

**❍ /country [ǫυєʀʏ] : ɢᴇᴛ ᴄᴏᴜɴᴛʀʏ ᴅᴇᴀᴛɪʟs
❍ /time : ɢᴇᴛ ᴄᴜʀʀᴇɴᴛ ᴛɪᴍᴇ & ᴅᴀᴛᴇ
❍ /weather [ǫυєʀʏ]: ᴄʜᴇᴄᴋ ᴄᴜʀʀᴇɴᴛ ᴡᴇᴀᴛʜᴇʀ sɪᴛᴜᴀᴛɪᴏɴ
❍ /calendar [ǫυєʀʏ] : ɢᴇᴛ ᴀʟʟ ʏᴇᴀʀs ᴄᴀʟᴇɴᴅᴇʀ
❍ /phone [ǫυєʀʏ] : ɢᴇᴛ ᴘʜᴏɴᴇ ᴅᴇᴀᴛɪʟs
❍ /getstate [ǫυєʀʏ] : ɢᴇᴛ ᴄᴏᴜɴᴛʀʏ sᴛᴀᴛᴇs

⋟ ᴄσᴜɴᴛʀʏ ʟᴀɴɢ ᴄσᴅє :- [ᴄʟɪᴄᴋ ʜєʀє](https://telegra.ph/%E1%B4%84%E1%B4%8F%E1%B4%9C%C9%B4%E1%B4%9B%CA%80%CA%8F-%CA%9F%C9%AAs%E1%B4%9B-%E1%B4%A1%C9%AA%E1%B4%9B%CA%9C-%CA%9F%E1%B4%80%C9%B4%C9%A2%E1%B4%9C%E1%B4%80%C9%A2%E1%B4%87-%E1%B4%84%E1%B4%8F%E1%B4%85%E1%B4%87-08-28)

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐀 ꯭ʟ ꯭ᴘ ꯭ʜ꯭ ᴧ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/TheSigmaCoder)**
'''

    HELP_32 = '''```
❖ ᴘᴜʀɢᴇ ❖```
**<u>❖ ʜєʀє ɪs ᴛʜє ʜєʟᴘ ғσʀ ᴘᴜʀɢᴇ :</u>**

**❍ /purge : ᴄʟᴇᴀɴ ɢʀᴏᴜᴘ ᴍᴇssᴀɢᴇs
❍ /spurge : ᴄʟᴇᴀɴ ɢʀᴏᴜᴘ ᴍsɢ sɪʟᴇɴᴛʟʏ
❍ /del : ʀᴇᴘʟʏ ᴛᴏ ᴀ ᴍsɢ ғᴏʀ ᴅᴇʟᴇᴛᴇ

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐀 ꯭ʟ ꯭ᴘ ꯭ʜ꯭ ᴧ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/TheSigmaCoder)**
'''


    HELP_33 = '''```
❖ ᴘʏᴛʜᴏɴ ❖```
**<u>❖ ʜєʀє ɪs ᴛʜє ʜєʟᴘ ғσʀ ᴘᴜᴛʜᴏɴ :**</u>

**❍ /syntax [ǫυєʀʏ] : ғɪx ᴘʏᴛʜᴏɴ ᴄᴏᴅᴇs ᴛᴇxᴛ + ғɪʟᴇ ʀᴇᴘʟʏ
❍ /print [ǫυєʀʏ]: ᴄᴏᴠᴇʀᴛ ᴛᴇxᴛ ᴛᴏ ᴄᴏᴅᴇs
❍ /pypi [ǫυєʀʏ] : ᴄʜᴇᴄᴋ ʟᴀᴛᴇsᴛ ᴠᴇʀsɪᴏɴs
❍ /txt : ʀᴇᴘʟʏ ᴛᴏ ᴛᴇxᴛ & ᴄᴏɴᴠᴇʀᴛ ғɪʟᴇ
❍ /paste : ʀᴇᴘʟʏ ᴀ ғɪʟᴇ ᴛᴏ ᴄᴏɴᴠᴇʀᴛ ɪᴍᴀɢᴇ ᴛᴇxᴛ

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐀 ꯭ʟ ꯭ᴘ ꯭ʜ꯭ ᴧ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/TheSigmaCoder)**
'''

    HELP_34 = '''```
❖ ʀᴀɴᴋɪɴɢ ❖```
**<u>❖ ʜєʀє ɪs ᴛʜє ʜєʟᴘ ғσʀ ʀᴀɴᴋɪɴɢ :</u>**

**❍ /today : ᴛᴏᴅᴀʏ ʟᴇᴀᴅᴇʀʙᴏᴀʀᴅ.
❍ /weekly : ᴡᴇᴇᴋʟʏ ʟᴇᴀᴅᴇʀʙᴏᴀʀᴅ.
❍ /overall : ᴀʟʟ ᴛɪᴍᴇ ʟᴇᴀᴅᴇʀʙᴏᴀʀᴅ.**

**<u>⊚ ʏᴏᴜ ᴄᴀɴ ᴀʟsᴏ ᴄʜᴇᴄᴋ ʙʏ ɪɴʟɪɴᴇ ʙᴜᴛᴛᴏɴs.</u>

❍ /rank :- sʜᴏᴡ ʀᴀɴᴋ ʙᴜᴛᴛᴏɴ.

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐀 ꯭ʟ ꯭ᴘ ꯭ʜ꯭ ᴧ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/TheSigmaCoder)**
'''

    HELP_35 = '''```
❖ ʀᴛᴍᴘ ʟɪᴠᴇ sᴛʀᴇᴀᴍ ❖```
**<u>❖ ʀᴛᴍᴘ ʟɪᴠᴇ sᴛʀᴇᴀᴍ ᴄᴏᴍᴍᴀɴᴅs :</u>**

❍ /setrtmp group id rtmp_link 

**• ʟɪηᴋ ʀᴛϻᴘ ᴛᴏ ɢʀσᴜᴘ (ᴘʀɪᴠᴧᴛᴇ σηʟʏ) ** 
**• єx :-** `/setrtmp -100xxx rtmps://xxxx` 

❍ /playstream song name  

**• єx :-** `/playstream tera fitoor`  

❍ /endstream :- sᴛσᴘ sᴛʀєᴧϻ (ᴧᴅϻɪηs σηʟʏ)  
  

**❖ ᴛᴜᴛᴏʀɪᴀʟ ᴠɪᴅᴇᴏ :- [ᴛᴀᴘ ʜᴇʀᴇ](https://t.me/Careless_Coder/20)


❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐀 ꯭ʟ ꯭ᴘ ꯭ʜ꯭ ᴧ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/TheSigmaCoder)**
'''
    
    HELP_36 = '''```
❖ ᴠᴄ ᴛᴏᴏʟs ❖```
**<u>❖ ʜєʀє ɪs ᴛʜє ʜєʟᴘ ғσʀ ᴠᴄ ᴛᴏᴏʟs :</u>**

**❍ /vcstart : sᴛᴀʀᴛ ɢʀᴏᴜᴘ ᴠɪᴅᴇᴏ ᴄʜᴀᴛ
❍ /vcend : ᴇɴᴅ ɢʀᴏᴜᴘ ᴠɪᴅᴇᴏ ᴄʜᴀᴛ
❍ /vcusers : ᴄʜᴇᴄᴋ ᴄᴜʀʀᴇɴᴛ ᴠᴄ ᴜsᴇʀs ɪɴғᴏ**

```
❖ ɴᴏᴛᴇ : ɪɴ ᴄᴀꜱᴇ ᴛʜᴇ ᴠᴏɪᴄᴇ ᴄʜᴀᴛ ᴇɴᴅꜱ, ᴛʜᴇ ʙᴏᴛ ᴍᴜꜱᴛ ʜᴀᴠᴇ ᴛʜᴇ ɴᴇᴡ ᴀᴅᴍɪɴ ʀɪɢʜᴛ.
```

**❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐀 ꯭ʟ ꯭ᴘ ꯭ʜ꯭ ᴧ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/TheSigmaCoder)**
'''

    
    SUDO_INFO = '''```
❖ ᴏᴡɴᴇʀ ᴄᴏᴍᴍᴀɴᴅs ❖```
**<u>❖ ʜєʀє ɪs ᴛʜє ʜєʟᴘ ғσʀ ᴏᴡɴᴇʀ ᴄᴏᴍᴍᴀɴᴅs :</u>**

**❖ ᴀss ʜᴀɴᴅʟᴇʀ :-

❍ /ac : sʜᴏᴡ ᴀᴄᴛɪᴠᴇ ᴠɪᴅᴇᴏ ᴀᴜᴅɪᴏ
❍ /activevc : sʜᴏᴡ ᴀᴄᴛɪᴠᴇ ᴠᴏɪᴄᴇ
❍ /activev : sʜᴏᴡ ᴀᴄᴛɪᴠᴇ ᴠɪᴅᴇᴏ

❍ /setpfp : sᴇᴛ ᴀss ᴘʜᴏᴛᴏ
❍ /delpfp : ᴅᴇʟᴇᴛᴇ ᴀss ᴘʜᴏᴛᴏ
❍ /setbio : sᴇᴛ ᴀss ʙɪᴏ
❍ /setname : sᴇʀ ᴀss ɴᴀᴍᴇ

❍ /userbotjoin : ᴀss ᴊᴏɪɴ ᴄᴜʀʀᴇɴᴛ ɢᴄ
❍ /userbotleave : ᴀss ʟᴇᴀᴠᴇ ᴄᴜʀʀᴇɴᴛ ɢᴄ
❍ leaveall : ᴀss ʟᴇᴀᴠᴇ ᴀʟʟ ɢᴄ

❖ ᴏᴡɴᴇʀ ʜᴀɴᴅʟᴇʀ :- 

❍ /banall : ʙᴀɴᴀʟʟ ᴍᴇᴍʙᴇʀs
❍ .raid : ʀᴀɪᴅ ᴀɴᴅ sᴘᴀᴍ
❍ /eco : ʙᴏᴛ ʀᴇᴘʟʏ ᴄᴍɴᴅ
❍ /gadd : ᴀᴅᴅ ʙᴏᴛ ʙʏ ᴀss
❍ /alpha : ɢᴇᴛ ᴇɴᴠ ᴄᴏᴍᴍᴀɴᴅ

❍ /addme : ᴘʀᴏᴍᴏᴛᴇ ᴍᴇ 
❍ /demoteme : ʀᴇᴍᴏᴠᴇ ᴍᴇ 
❍ /rban : ʀᴜɴ ʙᴀɴ
❍ /runban : ʀᴜɴ ᴜɴʙᴀɴ

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐀 ꯭ʟ ꯭ᴘ ꯭ʜ꯭ ᴧ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/TheSigmaCoder)**
'''


    
    
    HELP_PROMOTION = '''
**─────────────────────────
ㅤㅤ❖ ᴘᴧɪᴅ ᴘʀσϻσᴛɪση ᴧᴠᴧɪʟᴧʙʟє ❖
─────────────────────────
❍ ᴄʜᴧᴛᴛɪηɢ ɢʀσυᴘ's
❍ ᴄσʟσʀ ᴛʀᴧᴅɪηɢ ɢᴧϻє's
❍ ᴄʜᴧηηєʟ's | ɢʀσυᴘ's .....
❍ ʙєᴛᴛɪηɢ ᴧᴅs σʀ ᴧηʏᴛʜɪηɢ
─────────────────────────
● ᴘʀσϻσᴛє ᴧηʏᴛʜɪηɢ ʏσυ ᴡᴧηᴛ ση συʀ ᴘʟᴧᴛғσʀϻ ᴡɪᴛʜ ʙєsᴛ ᴘʟᴧηs ᴧηᴅ ᴘʀσᴘєʀ sєʀᴠɪᴄєs
─────────────────────────
● ᴅᴧɪʟʏ, ᴡєєᴋʟʏ ᴧηᴅ ϻσηᴛʜʟʏ ᴘʟᴧη'ꜱ ᴧᴠᴧɪʟᴧʙʟє ꜰσʀ ʙɪɢ ʙυꜱɪηєꜱꜱєꜱ ᴧᴛ ᴛʜє ʙєꜱᴛ ᴘσꜱꜱɪʙʟє ᴄσηᴅɪᴛɪσηꜱ !
─────────────────────────
ʙєsᴛ ᴧηᴅ ᴄʜєᴧᴘ ɪη ᴛєʟєɢʀᴧϻ 400-500+ ϻєϻʙєʀs ɪη σηє ᴘʀσϻσᴛɪση ɢυʀᴧηᴛєє...
─────────────────────────
❍ ᴄσηᴛᴧᴄᴛ - [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐀 ꯭ʟ ꯭ᴘ ꯭ʜ꯭ ᴧ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/TheSigmaCoder)
─────────────────────────**
'''
    HELP_ABOUT = '''
**─────────────────────
 ᴡєʟᴄσϻє ᴛσ ˹[ᴘᴜʀᴠɪ ʙᴏᴛs](https://t.me/PURVI_BOTS)˼ sᴛᴧᴛυs
──────────────────────
   ❖ │ ʀєᴧʟ ᴛɪϻє ʙσᴛ's sᴛᴧᴛυs │❖
──────────────────────
╭⎋ [ηɪᴋᴜ ꭙ ϻυsɪᴄ](https://t.me/NikuMusicBot) : ᴧʟɪᴠє 
╰⊚ υsᴧɢє : 24 ʜʀs | ᴧssɪsᴛᴧηᴛs : 01
       
╭⎋ [ᴅɪʏᴧ ꭙ ϻυsɪᴄ](https://t.me/DiyaMusicRobot) : ᴧʟɪᴠє 
╰⊚ υsᴧɢє : 24 ʜʀs | ᴧssɪsᴛᴧηᴛs : 01

╭⎋ [sᴏηᴧʟɪ ꭙ ᴄʜᴧᴛ](https://t.me/SonaliChatbot) : ᴧʟɪᴠє 
╰⊚ υsᴧɢє : 24 ʜʀs | ᴧssɪsᴛᴧηᴛs : 01
──────────────────────
⊚ ʙσᴛ sᴛᴧᴛυs & ϻσʀє ʙσᴛs - [ᴄʟɪᴄᴋ ʜєʀє](https://t.me/Purvibots)
──────────────────────
⊚ ʟᴧsᴛ ᴄʜєᴄᴋєᴅ ση  : `01.09.2025`
──────────────────────
❍ 𝐏ᴏᴡєʀєᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐀 ꯭ʟ ꯭ᴘ ꯭ʜ꯭ ᴧ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/TheSigmaCoder)
──────────────────────**
'''
    HELP_ALLBOT = '''
**─────────────────────
➻ ᴛʜɪs ɪs <u>{0}</u>
──────────────────────
❖ ᴧ ϻᴜsɪᴄ + ϻᴧηᴧɢєϻєηᴛ ʙσᴛ ғσʀ ᴛєʟєɢʀᴧϻ ɢʀσᴜᴘs / ᴄʜᴧηηєʟs
──────────────────────
● ᴡʀɪᴛᴛєη ɪη ➥ [ᴩʏᴛʜση](https://www.python.org/)
● ᴅᴧᴛᴧʙᴧsє ➥ [ϻᴏηɢᴏ-ᴅʙ](https://www.mongodb.com/)
● ʜєʟᴘ ᴡɪᴛʜ [ᴘʏʀσɢʀᴧϻ](https://github.com/pyrogram/pyrogram) & [ᴘʏ-ᴛɢᴄᴧʟʟs](https://github.com/pytgcalls/pytgcalls).
──────────────────────
● ηᴏ ʟᴀɢ ɪssᴜєs ηᴏ ᴧᴅs ηᴏ ʙᴜɢs.
● sᴜᴘᴘᴏʀᴛ ᴧʟʟ ᴛɪϻє sᴛᴧʏ ᴡɪᴛʜ ᴜs.
──────────────────────
❖ υᴘᴅᴧᴛєs ᴄʜᴧηηєʟ ➥ [ᴘᴜʀᴠɪ-ʙσᴛs](https://t.me/PURVI_BOTS)
❖ sυᴘᴘσʀᴛ ᴄʜᴧᴛ ➥ [ᴘᴜʀᴠɪ-ᴜᴘᴅᴧᴛєs](https://t.me/PURVI_UPDATES)
❖ ɢɪᴛ ʜᴜʙ ʟɪηᴋ ➥ [тєᴧϻ-ᴘᴜʀᴠɪ](github.com/TEAMPURVI)
──────────────────────**
'''

#------------------------------------------------------------------------------------------------------------------------
#------------------------------------------------------------------------------------------------------------------------
#------------------------------------------------------------------------------------------------------------------------


    
    fullpromote = {
    'can_change_info': True,
    'can_post_messages': True,
    'can_edit_messages': True,
    'can_delete_messages': True,
    'can_invite_users': True,
    'can_restrict_members': True,
    'can_pin_messages': True,
    'can_promote_members': True,
    'can_manage_chat': True,
    }

    
    promoteuser = {
    'can_change_info': False,
    'can_post_messages': True,
    'can_edit_messages': True,
    'can_delete_messages': False,
    'can_invite_users': True,
    'can_restrict_members': False,
    'can_pin_messages': False,
    'can_promote_members': False,
    'can_manage_chat': True,
    }




#------------------------------------------------------------------------------------------------------------------------
#------------------------------------------------------------------------------------------------------------------------
#------------------------------------------------------------------------------------------------------------------------
